In [1]:
# !pip install ipython-sql
# !pip install pymysql

In [2]:
import pandas as pd
import pymysql
import csv

In [3]:
print(f'pandas    version: {pd.__version__}')
print(f'pymysql   version: {pymysql.__version__}')

pandas    version: 1.4.2
pymysql   version: 1.0.2

In [4]:
%load_ext sql

## Discovery csv data

### data columns
- 1st column is product_id
- 2nd column is customer_id
- 3rd column is price
- 4th column is quantity
- 5th column is timestamp

In [5]:
df = pd.read_csv('dataset/oltpdata.csv', names=['product_id', 'customer_id', 'price', 'quantity', 'timestamp'], header=None)
df.head(5)

   product_id  customer_id  price  quantity       timestamp
0        6739        76305    230         1  5/9/2020 16:20
1        7460        81008   1455         4  5/9/2020 16:20
2        6701         7556   1159         2  5/9/2020 16:20
3        8021        36492   3727         2  5/9/2020 16:20
4        6442        11282   4387         5  5/9/2020 16:20

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2605 entries, 0 to 2604
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   2605 non-null   int64
 1   customer_id  2605 non-null   int64
 2   price        2605 non-null   int64
 3   quantity     2605 non-null   int64
 4   timestamp    2605 non-null   object
dtypes: int64(4), object(1)
memory usage: 101.9+ KB

## Convert timestamp column from object to datetime64

In [7]:
df['timestamp'] = df['timestamp'].astype('datetime64')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2605 entries, 0 to 2604
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   2605 non-null   int64
 1   customer_id  2605 non-null   int64
 2   price        2605 non-null   int64
 3   quantity     2605 non-null   int64
 4   timestamp    2605 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(4)
memory usage: 101.9 KB

In [9]:
df.head(5)

   product_id  customer_id  price  quantity           timestamp
0        6739        76305    230         1 2020-05-09 16:20:00
1        7460        81008   1455         4 2020-05-09 16:20:00
2        6701         7556   1159         2 2020-05-09 16:20:00
3        8021        36492   3727         2 2020-05-09 16:20:00
4        6442        11282   4387         5 2020-05-09 16:20:00

## Connect to MySQL server to create database and table

## MySQL connection

In [1]:
host = 'localhost'
port = 3306

username ='root'
password = 'root'

In [2]:
connection_string=f'mysql+pymysql://{username}:{password}@{host}:{port}'

In [12]:
%sql $connection_string

In [13]:
%%sql

drop database if exists sales;

create database sales;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.
1 rows affected.

[]

## Upload DataFrame to table

In [4]:
database = 'sales'

In [5]:
connection_string = connection_string + '/' + database

In [7]:
print(type(connection_string))

<class 'str'>

### DataFrame.to_sql will create new table for us

In [16]:
df.to_sql('sales_data', connection_string, index=False)

2605

## Confirm that data has beed loaded to MySQL

In [17]:
%sql use sales;

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [18]:
%sql select * from sales_data limit 10;

 * mysql+pymysql://root:***@localhost:3306
10 rows affected.

[(6739, 76305, 230, 1, datetime.datetime(2020, 5, 9, 16, 20)),
 (7460, 81008, 1455, 4, datetime.datetime(2020, 5, 9, 16, 20)),
 (6701, 7556, 1159, 2, datetime.datetime(2020, 5, 9, 16, 20)),
 (8021, 36492, 3727, 2, datetime.datetime(2020, 5, 9, 16, 20)),
 (6442, 11282, 4387, 5, datetime.datetime(2020, 5, 9, 16, 20)),
 (5643, 36216, 1619, 1, datetime.datetime(2020, 5, 9, 16, 20)),
 (7186, 48203, 2691, 5, datetime.datetime(2020, 5, 9, 16, 20)),
 (6668, 7427, 2037, 3, datetime.datetime(2020, 5, 9, 16, 20)),
 (8669, 51578, 4237, 4, datetime.datetime(2020, 5, 9, 16, 20)),
 (8206, 77899, 4089, 1, datetime.datetime(2020, 5, 9, 16, 20))]

## Create an index to make search queries much faster

In [19]:
%sql create index index1 on sales_data(product_id, customer_id);

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [20]:
%sql show index from sales_data

 * mysql+pymysql://root:***@localhost:3306
2 rows affected.

[('sales_data', 1, 'index1', 1, 'product_id', 'A', 1534, None, None, 'YES', 'BTREE', '', '', 'YES', None),
 ('sales_data', 1, 'index1', 2, 'customer_id', 'A', 2605, None, None, 'YES', 'BTREE', '', '', 'YES', None)]

## Queries some data

- Does customer buy multiple product?

In [21]:
%%sql

select count(product_id), count(distinct(product_id)), count(customer_id), count(distinct(customer_id)) 
    from sales_data;

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[(2605, 1534, 2605, 2516)]

- Most product_id purchased by customer

In [22]:
%%sql 

select product_id, count(product_id) as total_sell
    from sales_data
    group by product_id 
    order by total_sell desc limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(6601, 7), (7761, 7), (6646, 6), (6189, 6), (5643, 6)]

- Which customers_id most often buy things?

In [23]:
%%sql

select customer_id, count(customer_id) as buy_time
    from sales_data
    group by customer_id
    order by buy_time desc
    limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(22452, 3), (11776, 3), (12113, 2), (46775, 2), (7978, 2)]

- Which customer_id pay the most?

In [24]:
%%sql

select customer_id, quantity * price as total_pay
    from sales_data
    group by customer_id
    order by total_pay desc
    limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(36106, 24965),
 (83208, 24935),
 (80480, 24930),
 (55903, 24910),
 (45070, 24815)]

- What days are the most pay by customer ?

In [25]:
%%sql

select timestamp, quantity * price as total_pay
    from sales_data
    group by timestamp
    order by total_pay desc
    limit 5;

 * mysql+pymysql://root:***@localhost:3306
5 rows affected.

[(datetime.datetime(2020, 5, 9, 16, 47), 21925),
 (datetime.datetime(2020, 5, 9, 16, 32), 21535),
 (datetime.datetime(2020, 5, 9, 16, 28), 21080),
 (datetime.datetime(2020, 5, 9, 16, 29), 19820),
 (datetime.datetime(2020, 5, 9, 16, 45), 18790)]

## Dump database

In [27]:
import subprocess

table = 'sales_data'

with open(f'dataset\{table}_dump.sql','w') as output:
    c = subprocess.Popen(['mysqldump', '-u', username, '-p%s' %password, database],
                         stdout=output, shell=True)